NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG22/EFR32BG22C222F352GM40.svd
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <name>Copyright 2018 Silicon Laboratories, Inc.</name>
    <flashBaseAddress>0x00000000</flashBaseAddress>
    <flashSize>0x00080000</flashSize>
    <flashAccessTypes>rx</flashAccessTypes>
    <userdataBaseAddress>0x0FE00000</userdataBaseAddress>
    <userdataSize>0x00000400</userdataSize>
    <userdataAccessTypes>rx</userdataAccessTypes>
    <devinfoBaseAddress>0x0FE08000</devinfoBaseAddress>
    <devinfoSize>0x00000400</devinfoSize>
    <devinfoAccessTypes>rx</devinfoAccessTypes>
    <chipconfigBaseAddress>0x0FE0E000</chipconfigBaseAddress>
    <chipconfigSize>0x00000600</chipconfigSize>
    <chipconfigAccessTypes>rx</chipconfigAccessTypes>
    <ramBaseAddress>0x20000000</ramBaseAddress>
    <ramSize>0x00008000</ramSize>
    <ramAccessTypes>rwx</ramAccessTypes>
    <fifo_s_BaseAddress>0x4C024000</fifo_s_BaseAddress>
    <fifo_s_Size>0x00004000</fifo_s_Size>
    <fifo_s_AccessTypes>rwx</fifo_s_AccessTypes>
    <cryptoacc_s_BaseAddress>0x4C028000</cryptoacc_s_BaseAddress>
    <cryptoacc_s_Size>0x00001000</cryptoacc_s_Size>
    <cryptoacc_s_AccessTypes>rwx</cryptoacc_s_AccessTypes>
    <fifo_ns_BaseAddress>0x5C024000</fifo_ns_BaseAddress>
    <fifo_ns_Size>0x00004000</fifo_ns_Size>
    <fifo_ns_AccessTypes>rwx</fifo_ns_AccessTypes>
    <cryptoacc_ns_BaseAddress>0x5C028000</cryptoacc_ns_BaseAddress>
    <cryptoacc_ns_Size>0x00001000</cryptoacc_ns_Size>
    <cryptoacc_ns_AccessTypes>rwx</cryptoacc_ns_AccessTypes>
    <seqram_s_BaseAddress>0xA0000000</seqram_s_BaseAddress>
    <seqram_s_Size>0x00004000</seqram_s_Size>
    <seqram_s_AccessTypes>rwx</seqram_s_AccessTypes>
    <frcram_s_BaseAddress>0xA0004000</frcram_s_BaseAddress>
    <frcram_s_Size>0x00001000</frcram_s_Size>
    <frcram_s_AccessTypes>rwx</frcram_s_AccessTypes>
    <seqram_ns_BaseAddress>0xB0000000</seqram_ns_BaseAddress>
    <seqram_ns_Size>0x00004000</seqram_ns_Size>
    <seqram_ns_AccessTypes>rwx</seqram_ns_AccessTypes>
    <frcram_ns_BaseAddress>0xB0004000</frcram_ns_BaseAddress>
    <frcram_ns_Size>0x00001000</frcram_ns_Size>
    <frcram_ns_AccessTypes>rwx</frcram_ns_AccessTypes>
  </vendorExtensions>
</device>
